In [1]:
#adding and removing columns to/from a dataframe

In [2]:
#creating a dataframe first

In [5]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [7]:
df=pd.DataFrame(randn(4,4),index="A B C D".split(), columns="W X Y Z".split())

In [8]:
df

          W         X         Y         Z
A  0.697711 -0.442057  0.327075  0.602995
B  0.071511  0.152814  1.279607 -0.887000
C -0.348182 -1.674475 -0.342149 -1.160898
D  1.044690  1.167852  1.141023  1.687540

In [9]:
df["ZN"]=[1,2,3,4]

In [10]:
df

          W         X         Y         Z  ZN
A  0.697711 -0.442057  0.327075  0.602995   1
B  0.071511  0.152814  1.279607 -0.887000   2
C -0.348182 -1.674475 -0.342149 -1.160898   3
D  1.044690  1.167852  1.141023  1.687540   4

In [11]:
#we have added a new column successfully

In [12]:
#lets remove the column

In [13]:
df.drop("ZN",axis=1)

          W         X         Y         Z
A  0.697711 -0.442057  0.327075  0.602995
B  0.071511  0.152814  1.279607 -0.887000
C -0.348182 -1.674475 -0.342149 -1.160898
D  1.044690  1.167852  1.141023  1.687540

In [14]:
#but is it actually deleted?

In [15]:
df

          W         X         Y         Z  ZN
A  0.697711 -0.442057  0.327075  0.602995   1
B  0.071511  0.152814  1.279607 -0.887000   2
C -0.348182 -1.674475 -0.342149 -1.160898   3
D  1.044690  1.167852  1.141023  1.687540   4

In [16]:
#its still there

In [18]:
df.drop("ZN", axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  0.697711 -0.442057  0.327075  0.602995
B  0.071511  0.152814  1.279607 -0.887000
C -0.348182 -1.674475 -0.342149 -1.160898
D  1.044690  1.167852  1.141023  1.687540

In [ ]:
#successfully removed